In [29]:
import pandas as pd

In [33]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv",sep='\t')

In [34]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
df.dtypes                           #object is kind of a hybrid data type

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [5]:
df.dtypes==object

order_id              False
quantity              False
item_name              True
choice_description     True
item_price             True
dtype: bool

In [5]:
df.describe()             # when we directly call describe for a df it  only describes the integer columns

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [14]:
df.dtypes[df.dtypes==object].index               #will choose columns with dtypes object

Index(['item_name', 'choice_description', 'item_price'], dtype='object')

In [16]:
df[df.dtypes[df.dtypes==object].index]

,item_name,choice_description,item_price
0,Chips and Fresh Tomato Salsa,NaN,$2.39
1,Izze,[Clementine],$3.39
2,Nantucket Nectar,[Apple],$3.39
3,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...
4617,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [31]:
#df.item_name.unique()
df.item_price.unique()

array(['$2.39 ', '$3.39 ', '$16.98 ', '$10.98 ', '$1.69 ', '$11.75 ',
       '$9.25 ', '$4.45 ', '$8.75 ', '$11.25 ', '$8.49 ', '$2.18 ',
       '$8.99 ', '$1.09 ', '$2.95 ', '$2.15 ', '$3.99 ', '$22.50 ',
       '$11.48 ', '$17.98 ', '$17.50 ', '$4.30 ', '$5.90 ', '$1.25 ',
       '$23.78 ', '$6.49 ', '$11.08 ', '$1.50 ', '$22.16 ', '$32.94 ',
       '$22.20 ', '$10.58 ', '$2.50 ', '$23.50 ', '$7.40 ', '$18.50 ',
       '$3.00 ', '$6.78 ', '$11.89 ', '$9.39 ', '$4.00 ', '$3.75 ',
       '$8.69 ', '$2.29 ', '$8.90 ', '$3.27 ', '$3.89 ', '$8.19 ',
       '$35.00 ', '$27.75 ', '$11.80 ', '$6.00 ', '$26.25 ', '$21.96 ',
       '$4.36 ', '$7.50 ', '$4.78 ', '$13.35 ', '$6.45 ', '$5.07 ',
       '$22.96 ', '$7.17 ', '$7.98 ', '$4.50 ', '$26.07 ', '$12.98 ',
       '$35.25 ', '$44.25 ', '$10.50 ', '$33.75 ', '$16.38 ', '$13.52 ',
       '$5.00 ', '$15.00 ', '$8.50 ', '$17.80 ', '$1.99 ', '$11.49 '],
      dtype=object)

In [21]:
a= df.dtypes[df.dtypes==object].index           # list dtypes jo object hai
a                                                 # dataframe sirf object dtypes ka
df[a].describe()                               #df 'a' ko describe kia

           item_name choice_description item_price
count           4622               3376       4622
unique            50               1043         78
top     Chicken Bowl        [Diet Coke]     $8.75
freq             726                134        730

In [22]:
df[a].item_price.unique()

array(['$2.39 ', '$3.39 ', '$16.98 ', '$10.98 ', '$1.69 ', '$11.75 ',
       '$9.25 ', '$4.45 ', '$8.75 ', '$11.25 ', '$8.49 ', '$2.18 ',
       '$8.99 ', '$1.09 ', '$2.95 ', '$2.15 ', '$3.99 ', '$22.50 ',
       '$11.48 ', '$17.98 ', '$17.50 ', '$4.30 ', '$5.90 ', '$1.25 ',
       '$23.78 ', '$6.49 ', '$11.08 ', '$1.50 ', '$22.16 ', '$32.94 ',
       '$22.20 ', '$10.58 ', '$2.50 ', '$23.50 ', '$7.40 ', '$18.50 ',
       '$3.00 ', '$6.78 ', '$11.89 ', '$9.39 ', '$4.00 ', '$3.75 ',
       '$8.69 ', '$2.29 ', '$8.90 ', '$3.27 ', '$3.89 ', '$8.19 ',
       '$35.00 ', '$27.75 ', '$11.80 ', '$6.00 ', '$26.25 ', '$21.96 ',
       '$4.36 ', '$7.50 ', '$4.78 ', '$13.35 ', '$6.45 ', '$5.07 ',
       '$22.96 ', '$7.17 ', '$7.98 ', '$4.50 ', '$26.07 ', '$12.98 ',
       '$35.25 ', '$44.25 ', '$10.50 ', '$33.75 ', '$16.38 ', '$13.52 ',
       '$5.00 ', '$15.00 ', '$8.50 ', '$17.80 ', '$1.99 ', '$11.49 '],
      dtype=object)

In [23]:
df[a].item_price.value_counts()                   # unique price ki frequency kitni hai -value_counts()
                                                  # ex- $8.75 ka samaan 730 baar lia gya hai

$8.75      730
$11.25     521
$9.25      398
$4.45      349
$8.49      311
          ...
$13.35       1
$7.50        1
$4.36        1
$11.80       1
$11.49       1
Name: item_price, Length: 78, dtype: int64

In [35]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [39]:
list(df.index)

TypeError: 'list' object is not callable

In [40]:
df[['item_name','item_price']]

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

In [42]:
sorted(df['item_name'])[5:10:2]

['6 Pack Soft Drink', '6 Pack Soft Drink', '6 Pack Soft Drink']

In [47]:
#df.describe()            #only int values are descibed (from Mean to max are for int valuse)
df.describe(include="all") # unique to freq non int type(obj)          count is in both

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [59]:
dl=pd.Categorical(df['order_id'])
dl

[1, 1, 1, 1, 2, ..., 1833, 1833, 1834, 1834, 1834]
Length: 4622
Categories (1834, int64): [1, 2, 3, 4, ..., 1831, 1832, 1833, 1834]

In [60]:
type(dl)

pandas.core.arrays.categorical.Categorical

In [62]:
df["order_id"].unique()

array([   1,    2,    3, ..., 1832, 1833, 1834])

In [63]:
df['neworder_id']=dl             #new column 'new orderid' having dtype category added and data added from dl(which is category)'

In [64]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,neworder_id
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,1
1,1,1,Izze,[Clementine],$3.39,1
2,1,1,Nantucket Nectar,[Apple],$3.39,1
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,1
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,2

In [66]:
df.dtypes                      #category takes less space than object 
                              ## categories can be analysed by graphs like matplot and seaborn

order_id                 int64
quantity                 int64
item_name               object
choice_description      object
item_price              object
neworder_id           category
dtype: object

In [68]:
pd.Categorical(["one","two","three","one","two","three"],categories=["one","two","three"],ordered=True)

['one', 'two', 'three', 'one', 'two', 'three']
Categories (3, object): ['one' < 'two' < 'three']

In [73]:
df.head()                  #we can see new clumn newordrid with dtype category
#df..unique()

,order_id,quantity,item_name,choice_description,item_price,neworder_id
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,1
1,1,1,Izze,[Clementine],$3.39,1
2,1,1,Nantucket Nectar,[Apple],$3.39,1
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,1
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,2

In [74]:
df.neworder_id.unique()

[1, 2, 3, 4, 5, ..., 1830, 1831, 1832, 1833, 1834]
Length: 1834
Categories (1834, int64): [1, 2, 3, 4, ..., 1831, 1832, 1833, 1834]

In [76]:
df.neworder_id.value_counts()       #counting each unique in category

926     23
1483    14
205     12
759     11
1786    11
        ..
768      1
341      1
1048     1
94       1
1199     1
Name: neworder_id, Length: 1834, dtype: int64

In [77]:
#to remove any row
df.drop([0])                      will drop 0 row

In [79]:
df.drop(['quantity'],axis=1)          # will drop column quanity which has axis=1

,order_id,item_name,choice_description,item_price,neworder_id
0,1,Chips and Fresh Tomato Salsa,NaN,$2.39,1
1,1,Izze,[Clementine],$3.39,1
2,1,Nantucket Nectar,[Apple],$3.39,1
3,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,1
4,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,2
...,...,...,...,...,...
4617,1833,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,1833
4618,1833,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,1833
4619,1834,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,1834
4620,1834,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,1834
4621,1834,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,1834

In [81]:
df                # we can see even after dropping quantity column it is still available
           #so changes are made in a copy of df, to permanently change df put "inplace"

,order_id,quantity,item_name,choice_description,item_price,neworder_id
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,1
1,1,1,Izze,[Clementine],$3.39,1
2,1,1,Nantucket Nectar,[Apple],$3.39,1
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,1
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,2
...,...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,1833
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,1833
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,1834
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,1834
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,1834

In [ ]:
df.drop(['quantity'],axis=1,inplace=True)      #does changes in the main dataframe df

In [90]:
#df[df.quantity.notnull()].index
df['quantity'][df.quantity.notnull()]                  #isnulland notnull for finnding null value

0       1
1       1
2       1
3       1
4       2
       ..
4617    1
4618    1
4619    1
4620    1
4621    1
Name: quantity, Length: 4622, dtype: int64

In [95]:
df.iloc[5,:]             #locate row with values      # 5,: 5 is row and : means all columns (ex-0:4, means columns frm 0-4)

order_id                                                              3
quantity                                                              1
item_name                                                  Chicken Bowl
choice_description    [Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...
item_price                                                      $10.98
neworder_id                                                           3
Name: 5, dtype: object

In [109]:
df.iloc[0:10,0:3]

   order_id  quantity                              item_name
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl
5         3         1                           Chicken Bowl
6         3         1                          Side of Chips
7         4         1                          Steak Burrito
8         4         1                       Steak Soft Tacos
9         5         1                          Steak Burrito

In [ ]:
#we can fill missing value with fillna

df[['quantity']].fillna(5)      #null value replace with 5 , so we can replace any null value to  any value
# ex- df[['quantity']].fillna(min(df['quantity']))  #replace nan with min  value of the column